{
	"major": [
		{
			"tonic": "C",
			"mode": "major",
			"church-mode": "ionian",
			"description": "The C major scale is fundamental in Western music, comprising the notes C, D, E, F, G, A, and B. Its triad, consisting of C, E, and G, evokes a bright and joyful mood. Historically linked to classical music, it embodies positive emotions and is associated with composers like Mozart and Haydn."
		},
		{
			"tonic": "Db",
			"mode": "major",
			"church-mode": "ionian",
			"description": "The D-flat major scale, with its mellow and introspective character, features the notes D-flat, E-flat, F, G-flat, A-flat, B-flat, and C. Its rich and somber tones have been favored by composers like Chopin and Rachmaninoff, lending a sense of melancholy and depth to their compositions."
		},
		{
			"tonic": "D",
			"mode": "major",
			"church-mode": "ionian",
			"description": "The D major scale, with its bright and energetic quality, comprises the notes D, E, F-sharp, G, A, B, and C-sharp. Its triumphant and heroic character has made it a popular choice for military marches and fanfares, as well as for grand orchestral works by composers like Beethoven and Tchaikovsky."
		},
		{
			"tonic": "Eb",
			"mode": "major",
			"church-mode": "ionian",
			"description": "The E-flat major scale, with its warm and mellow tones, features the notes E-flat, F, G, A-flat, B-flat, C, and D. Its rich and velvety character has made it a favorite among composers like Brahms and Elgar, lending a sense of nostalgia and romance to their works."
		},
		{
			"tonic": "E",
			"mode": "major",
			"church-mode": "ionian",
			"description": "The E major scale, with its bright and vibrant character, comprises the notes E, F-sharp, G-sharp, A, B, C-sharp, and D-sharp. Its uplifting and joyous quality has made it a popular choice for celebratory works, such as Handel's 'Messiah' and Beethoven's 'Eroica' Symphony."
		},
		{
			"tonic": "F",
			"mode": "major",
			"church-mode": "ionian",
			"description": "The F major scale, with its warm and pastoral tones, features the notes F, G, A, B-flat, C, D, and E. Its gentle and serene character has made it a favorite among composers like Beethoven and Schubert, lending a sense of tranquility and contentment to their works."
		},
		{
			"tonic": "F#",
			"mode": "major",
			"church-mode": "ionian",
			"description": "The F-sharp major scale, with its brilliant and radiant quality, comprises the notes F-sharp, G-sharp, A-sharp, B, C-sharp, D-sharp, and E-sharp. Its dazzling and triumphant character has made it a popular choice for grand orchestral works and virtuosic solo pieces by composers like Liszt and Rachmaninoff."
		},
		{
			"tonic": "G",
			"mode": "major",
			"church-mode": "ionian",
			"description": "The G major scale, with its warm and resonant tones, features the notes G, A, B, C, D, E, and F-sharp. Its rich and robust character has made it a favorite among composers like Haydn and Brahms, lending a sense of strength and nobility to their works."
		},
		{
			"tonic": "Ab",
			"mode": "major",
			"church-mode": "ionian",
			"description": "The A-flat major scale, with its lush and romantic quality, comprises the notes A-flat, B-flat, C, D-flat, E-flat, F, and G. Its velvety and expressive character has made it a favorite among composers like Chopin and Debussy, lending a sense of yearning and passion to their compositions."
		},
		{
			"tonic": "A",
			"mode": "major",
			"church-mode": "ionian",
			"description": "The A major scale, with its bright and cheerful character, features the notes A, B, C-sharp, D, E, F-sharp, and G-sharp. Its uplifting and joyous quality has made it a popular choice for celebratory works, such as Handel's 'Water Music' and Mozart's 'Eine Kleine Nachtmusik'."
		},
		{
			"tonic": "Bb",
			"mode": "major",
			"church-mode": "ionian",
			"description": "The B-flat major scale, with its warm and mellow tones, comprises the notes B-flat, C, D, E-flat, F, G, and A. Its rich and velvety character has made it a favorite among composers like Brahms and Dvořák, lending a sense of nostalgia and romance to their works."
		},
		{
			"tonic": "B",
			"mode": "major",
			"church-mode": "ionian",
			"description": "The B major scale, with its brilliant and radiant quality, features the notes B, C-sharp, D-sharp, E, F-sharp, G-sharp, and A-sharp. Its dazzling and triumphant character has made it a popular choice for grand orchestral works and virtuosic solo pieces by composers like Liszt and Prokofiev."
		}
	],
	"minor": [
		{
			"tonic": "C",
			"mode": "minor",
			"church-mode": "aeolian",
			"description": "The C minor scale, with its somber and introspective character, comprises the notes C, D, E-flat, F, G, A-flat, and B-flat. Its melancholic and pensive tones have made it a favorite among composers like Chopin and Rachmaninoff, lending a sense of depth and emotion to their works."
		},
		{
			"tonic": "C#",
			"mode": "minor",
			"church-mode": "aeolian",
			"description": "The C-sharp minor scale, with its intense and dramatic quality, features the notes C-sharp, D-sharp, E, F-sharp, G-sharp, A, and B. Its passionate and turbulent character has made it a popular choice for works expressing deep emotions, such as Beethoven's 'Moonlight Sonata' and Tchaikovsky's 'Swan Lake'."
		},
		{
			"tonic": "D",
			"mode": "minor",
			"church-mode": "aeolian",
			"description": "The D minor scale, with its melancholic and introspective tones, comprises the notes D, E, F, G, A, B-flat, and C. Its somber and pensive character has made it a favorite among composers like Schubert and Brahms, lending a sense of longing and nostalgia to their works."
		},
		{
			"tonic": "Eb",
			"mode": "minor",
			"church-mode": "aeolian",
			"description": "The E-flat minor scale, with its rich and velvety quality, features the notes E-flat, F, G-flat, A-flat, B-flat, C-flat, and D-flat. Its lush and expressive character has made it a favorite among composers like Chopin and Debussy, lending a sense of yearning and passion to their compositions."
		},
		{
			"tonic": "E",
			"mode": "minor",
			"church-mode": "aeolian",
			"description": "The E minor scale, with its haunting and melancholic tones, comprises the notes E, F-sharp, G, A, B, C, and D. Its somber and introspective character has made it a favorite among composers like Grieg and Sibelius, lending a sense of mystery and introspection to their works."
		},
		{
			"tonic": "F",
			"mode": "minor",
			"church-mode": "aeolian",
			"description": "The F minor scale, with its dark and brooding quality, features the notes F, G, A-flat, B-flat, C, D-flat, and E-flat. Its intense and turbulent character has made it a popular choice for works expressing deep emotions, such as Beethoven's 'Appassionata' Sonata and Brahms' 'Tragic' Overture."
		},
		{
			"tonic": "F#",
			"mode": "minor",
			"church-mode": "aeolian",
			"description": "The F-sharp minor scale, with its haunting and melancholic tones, comprises the notes F-sharp, G-sharp, A, B, C-sharp, D, and E. Its somber and introspective character has made it a favorite among composers like Chopin and Tchaikovsky, lending a sense of longing and nostalgia to their works."
		},
		{
			"tonic": "G",
			"mode": "minor",
			"church-mode": "aeolian",
			"description": "The G minor scale, with its dark and brooding quality, features the notes G, A, B-flat, C, D, E-flat, and F. Its intense and turbulent character has made it a popular choice for works expressing deep emotions, such as Beethoven's 'Pathétique' Sonata and Brahms' 'Tragic' Overture."
		},
		{
			"tonic": "G#",
			"mode": "minor",
			"church-mode": "aeolian",
			"description": "The G-sharp minor scale, with its intense and dramatic quality, comprises the notes G-sharp, A-sharp, B, C-sharp, D-sharp, E, and F-sharp. Its passionate and turbulent character has made it a popular choice for works expressing deep emotions, such as Tchaikovsky's 'Pathétique' Symphony and Prokofiev's 'Romeo and Juliet'."
		},
		{
			"tonic": "A",
			"mode": "minor",
			"church-mode": "aeolian",
			"description": "The A minor scale, with its melancholic and introspective tones, features the notes A, B, C, D, E, F, and G. Its somber and pensive character has made it a favorite among composers like Schubert and Brahms, lending a sense of longing and nostalgia to their works."
		},
		{
			"tonic": "Bb",
			"mode": "minor",
			"church-mode": "aeolian",
			"description": "The B-flat minor scale, with its rich and velvety quality, comprises the notes B-flat, C, D-flat, E-flat, F, G-flat, and A-flat. Its lush and expressive character has made it a favorite among composers like Chopin and Debussy, lending a sense of yearning and passion to their compositions."
		},
		{
			"tonic": "B",
			"mode": "minor",
			"church-mode": "aeolian",
			"description": "The B minor scale, with its intense and dramatic quality, features the notes B, C-sharp, D, E, F-sharp, G, and A. Its passionate and turbulent character has made it a popular choice for works expressing deep emotions, such as Tchaikovsky's 'Pathétique' Symphony and Prokofiev's 'Romeo and Juliet'."
		}
	]
}
